[
  {
    "title": "Slaying the Monster",
    "description": "I am a survivor. I am a warrior. Here is my story:  My journey began in my 20s when\nI was prescribed pain medication for the first time. It started out as no big\ndeal. I had back pain, so I went to a pain management clinic. I expected to\nreceive an MRI or X-ray, but instead I was prescribed 3 different pain medications.\nI was happy to try anything that would relieve my back pain. And it definitely\ndid. My then-husband and I would refill my prescriptions every month without\nfail. After a year, my doctor asked me to sign forms to indicate that I\nunderstood these prescriptions were highly addictive. I would have gladly\nsigned anything. This went on for years.In my early 30s, I decided I\nwanted a child and became pregnant. On my own, I decided to quit taking my pain\nmedications. I knew going through withdrawal would not be easy, but I also knew\nwhat symptoms to expect.After my daughter was born, I started\ntaking prescription pain medications—again—and this time I was going through\nprescriptions faster than I could renew them. I then transitioned to using\nheroin to help ease my withdrawal symptoms in between prescriptions. After some\ntime, I began using heroin even before I ran out of my pain medications. When\nmy daughter was 2, I decided enough was enough—I quit for good. I moved\nhundreds of miles away to completely separate myself from any familiar triggers.\nThis was my 8th time quitting,\nbut now I have my daughter as motivation. She saved my life, but my addiction\ncost me my home, my marriage, and the county I had lived in my entire life. I\nlost many, many friends through this process, and even some who died from the\nsame Monster that caused me so much suffering. I am 14 years clean this year.\nNo desires. No triggers. Just the memory of a life that was out of control. Only you can save yourself from The\nMonster. You are the one who became addicted; you are the one who needs to get\nthe necessary help/treatment for this disease. I beat The Monster. You can,\ntoo."
  },
  {
    "title": "I am your neighbor, your teacher, your daughter. You smile at me in the park",
    "description": "I am all those things. I am also a recovering addict. Who knows, you might be at risk for becoming an addict, too. So, if you’ve just finished your first prescription of opioid pain medication, think hard before getting more. The euphoria you feel now will go away and your soul will go with it. And if someone suggests medication assisted treatment, jump at the chance. I promise, it will be worth everything to you and those you love.I took my first pain medication at 15 following a serious car accident. But I continued long after the accident—until my early 20s, by which time I was hooked. Still, with a good job, I could afford my habit. And even though I was using more and more, I did well at work, so no one was the wiser—except me. I was broken inside, so I went away for a month and got clean. And then I took a pain medication for a toothache, and just like that, I was hooked again.The day I stopped for real was the day I found myself sitting in my car, out of pills, having an all-out panic attack. This time I was truly terrified. So I found a doctor who could prescribe medication assisted treatment, and I made the call that saved my life. Today, I no longer feel lost. Instead, I feel human for the first time in years. I am in the light. I am free. And I’ve been sober for 4 glorious years."
  },
  {
    "title": "I’m winning the battle, one day at a time",
    "description": "Today I’m a recovering addict, but it wasn’t always that way. My doctor first prescribed pain medication for endometriosis, a chronic disease that can be excruciating, when I was just 20 years old. That led to heroin, which led to jail, which led to using again. But then I got clean once and for all, even though I fight the Monster every day. Like most recovering addicts, I can tell you exactly how long I’ve been clean—1 year, 4 months, and 3 days. I have a lot of faith and hope that my recovery will continue. I fight the Monster every day, but believe me—recovery is possible."
  },
  {
    "title": "Recovery requires constant awareness",
    "description": "I don’t remember the first time a doctor prescribed pain medication for me. I think it was for a migraine. Then I had oral surgery, and the dentist prescribed more pain medication. You have no idea how quickly dependence on pain medication can creep up on you. And then one day, you realize all your pain medication is gone—and you panic. Today, I don’t take anything, even after surgery. Every day I fight the urge in my brain that tells me “you need this,” because I know in my heart that I don’t. Recovery will always be an effort, but I am determined to keep winning."
  },
  {
    "title": "Complications from surgery triggered my addiction",
    "description": "I’ve been a recovering addict for 4 years, and medication assisted treatment is what helped me get back on my feet. I had emergency gallbladder surgery many years ago, and there were complications during the procedure. Afterward, the pain was so intense my doctor prescribed an opioid pain medication. After 6 months I realized I was using more every day. In fact, even though I tried, I couldn’t stop taking it. It led to losing my career, my parents, and my whole life. Finally, I moved from Massachusetts to Florida to begin my recovery. Fast forward to today. I have a new career, a new home, and a new family–my husband and my baby, who’s 1. Anyone looking for help with accidental opioid addiction should strongly consider medication assisted treatment. Your life is worth the time and dedication."
  },
  {
    "title": "How I Won",
    "description": "I got bad osteoarthritis from a wreck. After it set in, I eventually became addicted to opiates. After abusing for ten years, I nearly overdosed and believed I wouldn’t live. Thank God I did! I stopped them weaning myself off and finally backed off until I was free! Now, I am so thankful I got free."
  },
  {
    "title": "Every day, it gets better",
    "description": "About 10 years ago I fell from a tree breaking my knee and tearing cartilage. I was given a prescription opioid, which worked wonders on the pain. When the pain was gone, I kept the bottle. As time and years passed, I took them for headaches and any other discomfort.Fast forward 8 years, I realized that if I could not stop taking them, I would overdose and die. No one knew I had an addiction until I talked to my brother and was admitted to the hospital to detox 8 days (every minute of which I wanted to die). I didn’t.After in-patient treatment of 30 days and 14 months later, I’m still clean. Every day is still hard, but every day it gets better."
  },
  {
    "title": "Recovery: It CAN be a reality",
    "description": "I’m Mike. I am 46 years old, from Ohio. I grew up in a small, farm town. I did the normal “partying” as a teenager, but nothing serious. I played college football and was injured in the last game my Sr. year. When I went to doctors for the pain in my back, I found out I had a bone spur on the inside of my spine that was causing a significant amount of pain. I started getting pain meds and different treatments, but the pain remained.It’s the same old story. I started getting an opioid pain reliever, but my tolerance accelerated quickly and within a few years I was getting other opioids from my doctor. At the time, I was a college football coach. After about 6 years of taking pills, I knew I had a problem. I started taking them for emotional pain or any time I had a “bad day”. I started teaching at the HS level and was a head football coach at a small school. Not many people knew about my secret addiction. My family knew, but they thought I was taking the amount prescribed.As many of you know, the doctor could not give me enough. My tolerance had built up so much that enough was never enough. I started getting them off the street. I wanted help. I knew I was addicted, but I was afraid I would lose my teaching job. Well, in 2008, my fear became a reality. I was stopped by the police after leaving a house that was being watched for dealing pills. They pulled me over and found pills that weren’t prescribed to me. The next day it was all over the local newspaper. This was my rock bottom.At the time, it was horrible, but looking back, it was a blessing in disguise. It saved my life. I had just started delving into the world of heroin and I know I would’ve ended up overdosing. I lost my teaching job and my teaching license. I was devastated. It was my love, my career. I went to a detox center and weaned off of medication assisted-treatment. I relapsed a few times that summer, but since Sept, 17, 2008, I’ve been clean. I went back to school and got my Substance Abuse Counseling license.At the time of writing this, I am now employed as a Drug and Alcohol counselor in Columbus, Ohio. It wasn’t an easy road, it’s still not at times. It DOES get easier. I am here to tell you that it CAN be done. Take one day at a time, stay busy and work on replacing unhealthy behaviors and thinking with healthy ones. Good Luck and God Bless."
  },
  {
    "title": "Coming Clean.... a mother’s addiction.",
    "description": "I just want them to\n  figure out what’s wrong with you”, my mother whispered over my hospital bed.\n  My eyes were closed and I was drenched in a cold sweat covered with eight\n  heated hospital blankets because I was freezing. I had been vomiting\n  throughout the night with severe abdominal pain that was unrelenting. I\n  didn’t have the energy to double over; I simply laid there on the bathroom\n  floor, my face in a puddle of my own vomit. The muscle cramps felt like all\n  of my muscles were simultaneously being ripped from my bones. My lips and\n  hands had gone numb and I couldn’t move without being carried. I wanted to\n  die. It had come to the point where I couldn’t even cry anymore and death\n  sounded like a dream. This, however, was not my first hospital visit for\n  these same symptoms. No. I had been in this situation several times before\n  and my beautiful mother was outraged that the doctors couldn’t find anything\n  wrong with me. I knew the truth, hidden by years of lies and clever ruses to\n  get my fix. I was an addict. A full-blown addict!  I was taking an excess of 500 mg of opioids\n  a day, and nobody knew my dirty little secret (not even my own mother).It started with the\n  onset of my fibromyalgia and my first visit to my new pain doctor. I was\n  diagnosed with Fibromyalgia at 26 along with a co-diagnosis of\n  osteoarthritis. It was 3 months after the birth of my daughter, my husband\n  deployed, and I could barely move my joints without tear-inducing pain in my\n  hips, neck, and shoulders. Having no idea at the time that I was most likely\n  also still experiencing a decent amount of inflammation from a 39-hour labor,\n  I saw my family doctor. He referred me to several specialists, and they all\n  seemed to agree on a diagnosis. It was fibromyalgia, and I was told that\n  there was no cure. Feeling hopeless, I immediately scheduled an appointment\n  with a friend’s pain doctor. I had my diagnoses, and I was ready to do the\n  hard work of fighting through this. You see, I’ve always been kind of a\n  fighter. The doctor was pleasant and seemed very knowledgeable of what I was\n  going through. He prescribed me an opioid pain reliever and a transdermal\n  pain patch and told me to come back three months later to report back and get\n  more meds. I began taking the opioid pain reliever immediately, as I was no\n  stranger to this particular opiate. Years prior, while\n  working as a bartender, I was pretty frequently medicated due to the\n  arthritis in my back. It took all my pain away. These pills became a godsend to\n  me. This was great!!! I was able to care for my newborn and play with my 4-year-old\n  son, pain free! I felt guilty about all my physical problems. Unable to\n  perform the tasks that I once completed with ease, I felt robbed of my health\n  at such a young age. I felt incompetent in every way. Even small chores had\n  become impossible for me to accomplish on my own. I felt as if I was more of\n  a burden on my family, rather than blessing, but with my new meds all that\n  went away! My first withdrawal was very mild. I had been on the medication\n  for about 4 months and a couple of my patches had fallen off in the shower.After 5 months, I had\n  built up a tolerance to the opioid pain reliever, so they switched me to another\n  one. This was perfectly fine with me. As long as I was pain free, I probably\n  would have tried anything they offered. Four years later, the pills had\n  become my crutches and both of my legs may as well have been broken. I\n  couldn’t live, stand, or function without them, at least that’s what my body\n  had me convinced of. It wasn’t about the pain from my fibromyalgia anymore. It\n  was about the pain from withdrawals. How did this happen to me? I had always\n  pictured junkies shooting up in dirty public restrooms not the seemingly held\n  together mother of two. How did I become this person? I was all consumed with\n  my fear of withdrawals and each time had proven to be worse and worse. I\n  would be laid up in bed for days whenever I ran out of my meds. It seemed\n  like there was no way out. The scariest thing about addiction is that by the\n  time you realize what you’ve gotten into, it’s almost always too late to get\n  out without help. I didn’t think that I could be the person I wanted to be\n  without them. I couldn’t be even a mediocre mother and wife. I was\n  devastated, lost, and in a state of extreme loneliness induced by my lies and\n  determination to keep my addiction a secret. I was ashamed.At the height of my\n  addiction, I was legally prescribed 180mg of extended release morphine AND\n  160mg of another opioid pain medication a day but my body needed more. I\n  should have been dead. At those levels, I may as well have been putting\n  heroin in my body. I began to frequently run out of my meds at the end of\n  each month, my condition steadily declined, and nobody even knew. I had become\n  a master manipulator. My husband began to notice a trend in my monthly\n  hospital visits including many ambulance rides, due to the severity of my\n  condition and tried to convince me to get help. But what could he do? What\n  could anybody do really? I didn’t even think there was anything I could do to\n  get out of this hole of darkness. Everything important to me had faded to\n  grey and the only thing I needed was my pills. At this point, I couldn’t feel\n  happiness, love, warmth or any of the good things in life without them. This\n  would be my final withdrawal, I told myself every time. I don’t need help,\n  I’m just in pain, I reiterated internally on a daily basis. I was lying to\n  everyone even myself. Then something happened. My pain doctor lost his\n  practice. Not too hard now, looking back, to see why.My supply had been cut\n  off. I was devastated and panicked by the idea of what was to come for me.\n  How had I gotten in this deep? How was I supposed to survive this? I slowly\n  began to wean myself off of the pills by buying them on the street and\n  cutting them in half. I sent my children to stay with my mother for a couple\n  weeks.  A hopelessness that runs\n  through your veins when nothing else matters and you’ve become a shell of\n  yourself. A severe opiate withdrawal isn’t something that I would wish on my\n  worst enemy. While the neurotransmitters were recalibrating themselves in my\n  brain, there seemed to always be this little voice whispering how much the\n  dark slumber of death would be so much better. The physical symptoms were\n  only the tip of the iceberg. My head became a nightmare that I thought I\n  would never wake up from. Would this misery ever go away? There were zero\n  moments of contentment through the first three months. Every single second\n  was a struggle. I knew that I was in a fight for my life and I still had\n  doubts of whether or not I even deserved a life worth living. It took me six\n  months to finally start feeling “normal” and they were the hardest of my\n  life. I knew that no matter what I had to keep fighting for my children to\n  banish these awful drugs from our lives. That’s exactly what I did.I’m now 2 years clean\n  and the drugs that once orchestrated my life are meaningless to me. There are\n  still days when I want to pop a pill because that was how I coped with life\n  for so long that it is almost second nature. I allow those desires, however,\n  to drift out of mind just as easily as they drifted in. Now, I’m different.\n  At 30 years old, I’m finally learning all about who I truly am and it’s just\n  like breathing again! Now I’m learning new coping strategies, healthy ones.\n  All of the broken relationships that my using destroyed have either been\n  repaired or forgotten and without the beast that was my addiction, I am free.\n  I finally have the amazing family life and career that I’ve always dreamt of\n  and with my pilled fueled blinders off and gone for good, I can finally see\n  color again."
  },
  {
    "title": "My 15+ years battle with prescription pain pills and heroin",
    "description": "When I was 15 years old, I had to have a tonsillectomy. That was my first experience with opiate medications.After I learned that I like the way these made me feel, I never stopped taking pain pills. It didn’t\n  help that my doctors kept giving and refilling my pain meds for whatever\n  reason I came up with. And so it went on this way well thru my 20’s and 30’s. First I would just eat them. Then I decided snorting was better. Before\n  heroin, I was smoking up to 20-30 opioids a day. When the price of those went\n  too high and became harder to find, I was introduced to black tar heroin. It was cheaper and had the same effect. I was addicted to heroin for 4 long years. Smoking and slamming.I finally realized one\n  day, how bad my addiction was really negatively affecting my family and\n  friends. I made the choice to finally get clean. Unfortunately, most programs\n  where I live didn’t accept my insurance. I never stopped looking for help and\n  I relapsed many times while searching. Finally, I got approved for a medication-assisted treatment.Today I am a year and\n  two months sober. I avoid my addictive triggers and I absolutely stay away from opioid meds. My life is better for it. We can beat these addictions one day, one person at a time."
  },
  {
    "title": "My story as a grateful recovering addict",
    "description": "Who am I and how’d I do it? Hello, my family, my brothers and sisters. I wanted to share something with you that you may not know or figured out by now. My name is Stephanie, and I am a grateful, recovering addict. I share this for multiple reasons: one being to perhaps help another addict or family member like I was helped these last few years. My story does not involve a drug-a-log. If you’re looking for a story like that or one that glorifies the using or ways and means to get more drugs, then stop reading now. My story is about recovery and how much better life in general is. I still go through days when the fairy makes a visit, and I stay clean through those days. With that said, here is my story.I realized what today is and what I’m doing instead. Today is September 1st, 2015, and I should be celebrating my 8th wedding anniversary. But my journey didn’t work the way I planned. Today, I am picking up my 4-year medallion instead. To me, this medallion is priceless. It marks the 2nd clean date anniversary since my divorce 1½ years ago. At one point in time, I saw my ex as my hero, my knight in shining armor who had rescued me from that rabbit hole I was going down. He also was a reservation in my early years of recovery. Thankfully, I worked through it before this whole mess. Though I had many times last year when I wanted to give up, I didn’t thanks to many people in my life. I admit I am proud of myself for making it to the other side and am being humble because I don’t want to get cocky. My addiction is still an arm’s length away, and if I let down my guard, the monster will rise up again to take me out of this world.To all who have been clean less than 24 hours, hang on. Keep putting one foot in front of the other and keep doing the next right thing for the right reason and you can make it to. To all who’ve helped me make it – the addict still out there, those of you with 1 hour, 1 day, 1 week, 1 month, 1, 5, 10, or more years, the relapser, the addict who died clean, the haters, naysayers, and all who’ve supported me – I humbly and gratefully thank you. Family, friends, addicts, non-addicts, professionals, clergy and my Facebook peeps near and far. People I love, like and dislike. People who have passed on. Most importantly, I am SO VERY grateful for my Higher Power saving me and either putting or taking away people and situations in my life. Without any one of you, I don’t think I’d be here. I truly understand when they say that people are put into or taken away from my path to either teach me or to help me grow. Thank you for helping me to get through these last few years.Before my addiction, I was a pretty good person with some flaws. I helped or took care of people to the best of my ability, and many times I helped too much to where I lost myself in the process. During my addiction, I was a lying, manipulative, conning, self-centered b****. I got to a point of desperation and total self-imposed isolation. I pushed everyone away either because I felt they didn’t understand me, they criticized me or wanted me to share my stuff. There were times I felt like a monster. Despite everyone’s begging and pleading, I felt like I wasn’t an addict. I could control my using. I could pull myself together and function just fine. I wasn’t like THOSE people. I wasn’t some dirty homeless person with a needle in my arm. My drugs of choice were prescribed to me.I felt like this until the fateful weekend that changed my mind. I was caring for my stepson for a weekend while his dad was out of town. My using had gotten so bad that I couldn’t hold any food down except vanilla pudding. That weekend, I couldn’t even put 1 hour of time together without using. I puked all over myself while he (then 8 or 10 years old) cleaned me up. I couldn’t even stand on my own 2 feet. I sent my stepson home early and sat down and talked with my parents. I reached out for help and I got it, even though I still didn’t feel I needed it or belonged where I ended up starting to get clean (rehab). I thought after rehab I could figure out how to use successfully. Since then, I have had a couple of life changes. I have had 3 relapses, 2 of which were overdoses and 1 of those I was found with my dog keeping me alive and my heart beating 8 beats per second.While being in recovery, I’ve had some pretty rough times, but I’ve had some awesome times too. I’ve even had times I wanted to say f*** and go get high. Today, I have the desire not to use. Today, no longer am I a lying, thieving, conning, manipulative, self-centered little girl. The trying times I’ve had while in recovery have taught me many lessons for which I am SO grateful. Today, no longer am I isolated and feeling lonely. Today, I have MANY, MANY friends in and out of recovery and even around the world! There was one person who helped me a lot. I found him in an online support group, and we even chatted thru our messenger service. His name is Doug. I met him last year when I was at the lowest time I think I’ve ever been in my life. When I came across Doug’s daily reflections, I was in a very dark place in my life, and I just wanted to run away and never come back. His words that would appear on my screen helped me more than I can say. His passing away was a total shock, and it devastated me inside, as it has for his family and the multitude of friends. No longer would I read his words every morning with my coffee and other daily reflections.Then, never in my life expected his family to share his work with me, let alone have faith and confidence in me to honor Doug’s memory and be able to share my thoughts. I’ve never really been a writer, but I’ve been creative in other areas of my life. I rediscovered who I am and discovered new things about myself and passions. Writing is becoming a passion along with gardening and hiking. Sharing my thoughts, experience, strength, hope, fears…all that stuff has been very cathartic for me since I can’t express my feelings very effectively when I speak.No longer am I as much of a people pleaser, a character defect I struggle with. Today, I’m taking better care of me. Today, I have a better understanding of who I am as a woman and what I want in life. I’ve rediscovered myself and discovered new things about myself and new passions. People who’ve known me for many years say I’m different now than before and during my addiction. Truth is, I’m still me, just improved. Today, despite all that’s happened and the naysayers, I celebrate 4 years clean. I normally say I have a few 24 hours, so that it’s not overwhelming to a newcomer just trying to get 1 day clean. Today, more so than most days, I celebrate myself and life in general. Today, I can safely say that if I can get and stay clean through all the crap I’ve been thru and ignoring the voices in my head that talk shit to me sometimes daily, well, so can any addict. I have SO MUCH gratitude for and am SO VERY blessed to have everyone who’s helped me get and stay clean."
  },
  {
    "title": "The Monster and me",
    "description": "My story begins just like everyone else. I was prescribed pain pills for an injury and continued using for 20+ years. Eventually, they quit helping me, even though I was on several pain medications.Finally, I had enough because I was going to the pain clinic every month and being drug tested. I believe they were trying to get rid of me. I, also hated the profuse sweating, chills, fatigue, red eyes and looking sleepy with my eyes almost closed.I talked to my family doctor and told him I wanted to get off opioids. I went to a hospital, and they started me on a medication to treat opioid addiction. I’m now 7 months in and feel so much better. I look much better and family & friends have affirmed this. Also, I don’t sit around looking half asleep. I have so much more energy and looking forward to a new me!"
  },
  {
    "title": "My monster -- the demon within (Blue Devil)",
    "description": "For me it all started back in 2003. I was off to job corps to better my life. I was doing well for 6 months. I never touched a drug in my life. But one day, I was siting down, minding my own business. Then, came this guy picking a fight; we got into it real bad. Imagine: my finger was chopped off.I went to the hospital, and they put me back together. For the pain, they gave me a life changer. I was 17, and I was introduced to pain medication. It changed me forever.What I mean is after my finger healed I was still using the pain medication for every little pain. It was my Tylenol. Then, I meet a friend of a friend that had something better, who was like, “Hey, try this pain medication with this in it.” I was hooked. Every dollar, every move I made was so I could have that. And that went on for several years. I lost friends and family. People I loved just started to avoid me. I never stole or robbed anything or any body. It was just the way I started to act. “Different,” they said. But that’s not all.I moved away, thinking I could run from my problem cold turkey. I was good for six months. Got a real good job. Getting big bucks. Then, it went all south for me. I started to party, and someone had something and was like, “Try this. We are having so much fun. Why not? Let’s take it up a notch.” I did it to my self. Heroin. Oh my god, the rush.”I’m 30 years old, and I’ve only been on it for a year. I want to get off, but I feel like it wants my life. I want my life back. I’m about to lose my wife and my son. All because a stupid fight. Now I snort it on a daily basis to be normal. I can’t get rid of it. I need help but it seems every thing is well. I have to wait or deal with it. Thanks for hearing me out."
  },
  {
    "title": "6 Months Clean",
    "description": "When I turned 20 years old, I started to suffer from horrible headaches that resulted in trips to the ER. Tests showed that I had Chiari Brain Malformation type 1, resulting in headaches. They started treating them with prescription pain medications, while pregnant. My daughter was born withdrawal free, but that is when I started to realize it was too late for me.As I suffered the grip of addiction as a second time mother, the only thing that came to mind was to treat my headaches and keep withdrawal away. I drained my mother’s bank account and her savings.After one round of rehab failed, I went back into the depths of pills. Eventually, I lost my home, my mother, my fiancé, my son, my family, and all my friends. To the bottom I went and the only thing I had left was my autistic child, who required unforeseeable care. After a summer of couch hopping, Child Protective Services caught wind and took my daughter because her special needs were overwhelming for a homeless woman who couldn’t even care for herself. That is where the fight began.I found somewhat stable housing while I began treatment again for my second time. I revolved my whole world into doing better for my children and providing a safe home and environment for them. I am now six months sober. I have a home and am able to provide for them including my daughter back out of foster care. She has a severe form of autism that requires an enormous amount of care. Between that and treatment, it keeps me busy. I have my son on the weekends now, when he is not at school. He still lives with his grandma, but in April, I will have moved to a big enough home to bring him home too.I am six months clean and achieved so much. I’ve been told by many that I am the biggest comeback they have ever seen."
  },
  {
    "title": "My New Life",
    "description": "It is hard to walk away from something you have been controlled by for so long. You are scared, terrified and don’t know what to do or which way to go. There comes a time when you are physically, mentally and emotionally exhausted. It’s basically checkmate for you. So you take a leap and you fight for self-control. This is what I did. I was broke, alone, depressed and losing everything I cared for at a fast rate. We don’t see it. We don’t see our destructive behavior. We don’t see our future. We only see the next fix. Thankfully, I got sick and tired of being sick and tired.I got up and admitted I was an addict. I sought the one person who never gave up on me, God. I prayed, I cried and I fought. I fought hard and guess what I won! I recommitted my life for Jesus. I sought help and I stayed strong. It’s hard, but you have to have a powerful and strong support system. That is one of the most important parts of recovery. Relapse is and can be in any addicts’ future. We have to fight this fight daily. It doesn’t mean we’re weak, it means we’re strong. This disease is fast, strong and empowering. With the right help and tools everyone can beat addiction. Don’t give up!"
  },
  {
    "title": "7 Years Ago",
    "description": "Seven years ago (September 17, 2008) was my first day clean in four years. I made a series of bad decisions, the last one being my third suicide attempt (September 16, 2008). The physical and mental pain were unbearable until that attempt. I wanted the pain to go away. After, I decided I wanted to live. I wanted narcotics out of my life. Though I have chronic pain and mental illnesses, I no longer search for an escape, just understanding. I am proud that I have come so far and no longer crave that escape."
  },
  {
    "title": "Overcoming the Monster Inside",
    "description": "I was introduced to pain\nmedication in my late 20’s. What started out as a toothache became a horrifying\naddiction. I was prescribed opioids through a local dentist to relieve pain.\nEventually, those prescriptions were not enough to keep the Monster alive\nwithin. I started seeking doctors and making up pain to get what I thought I\nneeded. After learning that this was an addiction it was too late. My story had\nconsequences, including feeling like I lost my best friend. Today, I am proud\nto say I am winning one day at a time. The beast lies within, willing to take\nme down in a second. This is a battle that can be overcome. Reaching out to\nothers that have a similar story and talking about it on a daily basis, keeps\nit fresh in my mind that the Monster is patient and can attack when I’m not\nlooking. Just for today, I’m a Survivor!"
  },
  {
    "title": "Not afraid",
    "description": "I\nwas 22 years old with a toothache. Before this point, I despised drugs due to\nmy childhood and what they did to my parents. I had my tooth removed by a great\ndentist and was prescribed a 5mg opioid for the pain. I didn’t take any until I\ngot home, but when it hit my blood stream, I instantly felt complete. I have\nnever felt that way. I made a promise to quit when my daughter was born. But I\nconvinced myself it didn’t matter when the time came. Soon, I had about 10\ndealers and was up to 7-10 pills a day. Basically, I worked to skim by and afford\nenough to take while working. I was fired and deserved it.I\nam now 25 years old. My back teeth are rotting away. I cry myself to sleep in\npain because I am choosing the pain over the cost of a dental visit. I’d rather\nhave money to afford the dosage. My second daughter is now born, and I still\ncan’t justify quitting. I was fired again and evicted in the same week. It’s\nnow 2010 and I am getting married with no job. My soon to be wife will now\ncheck her bank account and find out I have a 4000 dollar I O U in there. We had\nto move into her mother’s place. Two daughters, one soon to be wife and a\nhighly lost opioid addict in one room. My wife’s mom saved the wedding with\nsavings and now I am going through withdrawal on our honeymoon. One month after\nthat I told her I was quitting and lie in bed for 10 days, chicken noodle puke!\nThen, I bump into a dealer with a free pill. I took it without\nhesitation. I\nstart to think I have control by having a three a day rule. I still have my\nwife in my life, but I don’t know who I am anymore. From an outside\nperspective, my wife and I looked somewhat normal, but we had grown apart to\nthe point we were almost roommates. She almost left me 1000 times. I am a\nmaster manipulator by now. I had given up on quitting all together. Fast\nforward to November 2014, I am driving to Phoenix when I hear the song “Not\nAfraid” by Eminem. The words hit me and I start crying like a baby. I like to\nthink it was the last good part of me crying out like an ash under an old\ncampfire. I feel dead inside, so I take the 18 pills I had and break them in\nhalf. \nI start from taking 6 pills a day to 5 halves, and know I am making progress.\nWeeks go by, and I don’t tell anyone I am quitting. They wouldn’t have believed\nme again. \nI cut down more and more, and I start to engage with my three girls more. My\nthinking is clear again. My dad notices that I’m awake when I talk to him and I’m\nfunny again. I had lost my cleverness. The drugs distorted me like a filter.I\nam kicking the addiction’s ass and I know it. I hesitate because I know I will\nbe off them fully soon. It’s like I am giving up a child. The dark love I have\nfor them is drawing me in, but why would I want to keep something that everyone\nis trying to quit? I put up the middle finger and was pain-sweat-shaking-agony\nfree. It hurts, but I’m a better person now. Anything else that I face is\nminiscule. I fill my void with work. It helps.A\nlot of songs I can’t listen to anymore because I want to be high. Now, I have\nmore important things to take care of. We are on the planet for a limited\namount of time. I want to take it in from every angle.  I\nread forums of people quitting a long time ago and they gave me hope. I told\nmyself I wouldn’t write one of these, but I know that it will help. Take care\nof your body and mind while you still can. The only regret I still\ncarry is that I didn’t quit sooner, but I’m happy that I now only have to deal\nwith regular problems."
  },
  {
    "title": "Recovery is Possible",
    "description": "After major back surgery in 1994, I was prescribed pain medication, but my friend flushed them down the toilet soon after. Years later and several severe injuries later, I became addicted. I was taking 18 pain pills a day. November 21st of this year, I will have nine years of sobriety."
  },
  {
    "title": "I’m fighting",
    "description": "A similar story to many, a car accident when I was 18. Good health insurance meant pain management. Pain management meant pills left and right. Back hurts? Take a pill! Before back hurts? Still take a pill, so it won’t hurt as much. Anxious from the pills? Here’s another pill.Then there I was: at 20 years-old, fully addicted. I knew it, I hated it. I was dying slowly instead of living.I am now 25 and four years clean. I am proud of myself every day. The pain has not stopped, nor has my desire to let it melt away with a pill. I fight it every day but as long as I’m fighting, I know I’m living."
  }
]